; domain
;; logistics domain Typed version.
;;

(define (domain logistics)
  (:requirements :strips :typing :action-costs)
  (:types
    truck airplane - vehicle
    package vehicle - physobj
    airport location - place
    city place physobj - object
  )

  (:predicates
    (in-city ?loc - place ?city - city)
    (at ?obj - physobj ?loc - place)
    (in ?pkg - package ?veh - vehicle)
  )

  (:functions
    (total-cost)
    (distance ?wp1 - place ?wp2 - place)
  )

  (:action LOAD-TRUCK
    :parameters (?pkg - package ?truck - truck ?loc - place)
    :precondition (and (at ?truck ?loc) (at ?pkg ?loc))
    :effect (and
      (not (at ?pkg ?loc))
      (in ?pkg ?truck)
      (increase (total-cost) 2)
    )
  )

  (:action LOAD-AIRPLANE
    :parameters (?pkg - package ?airplane - airplane ?loc - place)
    :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
    :effect (and
      (not (at ?pkg ?loc))
      (in ?pkg ?airplane)
    )
  )

  (:action UNLOAD-TRUCK
    :parameters (?pkg - package ?truck - truck ?loc - place)
    :precondition (and (at ?truck ?loc) (in ?pkg ?truck))
    :effect (and (not (in ?pkg ?truck)) (at ?pkg ?loc))
  )

  (:action UNLOAD-AIRPLANE
    :parameters (?pkg - package ?airplane - airplane ?loc - place)
    :precondition (and (in ?pkg ?airplane) (at ?airplane ?loc))
    :effect (and (not (in ?pkg ?airplane)) (at ?pkg ?loc))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
    :precondition (and (at ?truck ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to))
  )

  (:action FLY-AIRPLANE
    :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
    :precondition (at ?airplane ?loc-from)
    :effect (and
      (not (at ?airplane ?loc-from))
      (at ?airplane ?loc-to)
      (increase
        (total-cost)
        (distance ?loc-from ?loc-to))
    )
  )
)

; problem
(define (problem logistics-4-0)
  (:domain logistics)
  (:objects
    A380 A381 - airplane
    aA aB aC aD - airport
    A1 A2 B1 B2 C1 C2 D1 D2 - location
    A B C D - city
    truA truB truC truD - truck
    obj1 obj2 obj3 - package
  )

  (:init
    (= (total-cost) 0)
    (= (distance aA aB) 300)
    (= (distance aB aA) 300)
    (= (distance aA aC) 600)
    (= (distance aC aA) 600)
    (= (distance aA aD) 500)
    (= (distance aD aA) 500)
    (= (distance aB aC) 650)
    (= (distance aC aB) 650)
    (= (distance aB aD) 450)
    (= (distance aD aB) 450)
    (= (distance aC aD) 100)
    (= (distance aD aC) 100)
    (at A380 aB)
    (at A381 aC)

    (at truA A2)
    (at truB B1)
    (at truC C2)
    (at truD D1)

    (at obj1 B1)
    (at obj2 B2)
    (at obj3 C1)

    (in-city aA A)
    (in-city A1 A)
    (in-city A2 A)
    (in-city aB B)
    (in-city B1 B)
    (in-city B2 B)
    (in-city aC C)
    (in-city C1 C)
    (in-city C2 C)
    (in-city aD D)
    (in-city D1 D)
    (in-city D2 D)

  )

  (:goal
    (and
      (at obj1 aD)
      (at obj2 aA)
      (at obj3 aA))
  )

  (:metric minimize
    (total-cost)
  )
)

; plan
1. (load-truck obj1 trub b1)
   deleted: (at obj1 b1)
   added: (in obj1 trub)
   goals met: 0 of 3
2. (drive-truck trub b1 b2 b)
   deleted: (at trub b1)
   added: (at trub b2)
   goals met: 0 of 3
3. (load-truck obj2 trub b2)
   deleted: (at obj2 b2)
   added: (in obj2 trub)
   goals met: 0 of 3
4. (drive-truck trub b2 ab b)
   deleted: (at trub b2)
   added: (at trub ab)
   goals met: 0 of 3
5. (unload-truck obj2 trub ab)
   deleted: (in obj2 trub)
   added: (at obj2 ab)
   goals met: 0 of 3
6. (drive-truck truc c2 c1 c)
   deleted: (at truc c2)
   added: (at truc c1)
   goals met: 0 of 3
7. (load-truck obj3 truc c1)
   deleted: (at obj3 c1)
   added: (in obj3 truc)
   goals met: 0 of 3
8. (load-airplane obj2 a380 ab)
   deleted: (at obj2 ab)
   added: (in obj2 a380)
   goals met: 0 of 3
9. (drive-truck truc c1 ac c)
   deleted: (at truc c1)
   added: (at truc ac)
   goals met: 0 of 3
10. (unload-truck obj3 truc ac)
   deleted: (in obj3 truc)
   added: (at obj3 ac)
   goals met: 0 of 3
11. (unload-truck obj1 trub ab)
   deleted: (in obj1 trub)
   added: (at obj1 ab)
   goals met: 0 of 3
12. (load-airplane obj1 a380 ab)
   deleted: (at obj1 ab)
   added: (in obj1 a380)
   goals met: 0 of 3
13. (fly-airplane a380 ab ac)
   deleted: (at a380 ab)
   added: (at a380 ac)
   goals met: 0 of 3
14. (load-airplane obj3 a380 ac)
   deleted: (at obj3 ac)
   added: (in obj3 a380)
   goals met: 0 of 3
15. (fly-airplane a380 ac ad)
   deleted: (at a380 ac)
   added: (at a380 ad)
   goals met: 0 of 3
16. (unload-airplane obj1 a380 ad)
   deleted: (in obj1 a380)
   added: (at obj1 ad)
   goals met: 1 of 3
17. (fly-airplane a380 ad aa)
   deleted: (at a380 ad)
   added: (at a380 aa)
   goals met: 1 of 3
18. (unload-airplane obj2 a380 aa)
   deleted: (in obj2 a380)
   added: (at obj2 aa)
   goals met: 2 of 3
19. (unload-airplane obj3 a380 aa)
   deleted: (in obj3 a380)
   added: (at obj3 aa)
   goals met: 3 of 3
